let pickMeButton = false;
let counter = 0;
const questions = [" ما هو أول وعد من الله للبشر؟",
"متى كان أول سماح من الله للإنسان بأكل اللحوم؟ وما هو شرطه؟",
"ماذا كانت أول عقوبة إلهية جماعية؟ وماذا كانت الثانية، والثالثة؟؟؟",
"أذكر مثالًا لصوم لم يكن صومًا فرديًا وإنما صام فيه الشعب كله",
" من هو أول انسان دخل الفردوس ",
"من هو أول شهيد من شهداء المسيحية ",
"ملك من ملوك شعب اسرائيل",
"من هو أول من رأي الفادي بعد اتمام الفداء ",
" سلم ",
" عصا ",
" سفينة ",
" نجمة ",
" سور ",
" حفل زواج ",
" من هو الذي لقب بحامي الايمان الارثوزكسي ",
" من هو واضع قانون الايمان ",
" من من ملوك اسرائيل قتل اسد ودب؟ ",
" ثلاثة النار ملمستهمش ",
" ما هي الاناجيل الاربعة ",
" من هو كاتب سفر الأمثال ونشيد الانشاد",
" الى أي إنجيل يرمز الحيوان بوجه بشري",
" الى أي إنجيل يرمز الأسد المجنّح",
" الى أي إنجيل يرمز الثور المجنّح",
" من هو الإنجيلي الذي كان طبيباً",
"   ما معنى كلمة إنجيل وما أصلها",
" ما اسم الملاك الذي بشر سيدتنا مريم العذراء بحملها بيسوع",
" ما هو النشيد الذي قالته مريم عند زيارتها لأليصابات",
" كم شهراً كانت اليصابات حامل عندما بشر الملاك مريم العذراء ",
"  كم شهراً أقامت مريم العذراء عند اليصابات",
"  أين ولد يسوع",
"  ما معنى كلمة يسوع ",
" ما هي الهدايا التي قدمها المجوس للطفل يسوع",
"  أين هرب يوسف ومريم ويسوع من هيرودس بعد زيارة المجوس",
" كم كان عمر الأطفال الذين قتلهم هيرودس في بيت لحم ",
"  أين عاش يسوع",
"  أين كان يعمد يوحنا المعمدان",
" ماذا حدث عند عمادة يسوع على يد يوحنا المعمدان",
" كم كان عمر يسوع عندما بدأ رسالته بالبشارة",
" كم يوماً أقام وصام يسوع في البرية",
" ماذا كانت مهنة بطرس وأندراوس",
" ما هي أول أعجوبة ليسوع ؟ وأين ؟",
" ما هي الصلاة التي علمنا إياها يسوع ",
"ما أسم التلميذ الذي أحبه يسوع ",
" بكم باع يهوذا يسوع",
" كم مرة أنكر بطرس يسوع ",
"ما السر الذي تم في العشاء الأخير ",
" ما أسم الحاكم الروماني الذي حاكم يسوع",
" ما أسم المكان الذي صلب فيه يسوع",
" متى قام يسوع من بين الأموات ؟",
"     في كم يوم خلق الله العالم",
"   ما معنى كلمة آدم",
"خلصنا خلاص"
];






function toggle(){
    if(pickMeButton) {
        document.getElementById("question").style.display = "none";
        document.getElementById("intro").children[0].style.display ="block";
    } else{
        document.getElementById("intro").children[0].style.display ="none";
        document.getElementById("question").style.display = "block";
        document.getElementById("question").textContent = questions[counter];
        counter++;
    }
    pickMeButton = !pickMeButton;
}


